while True:
    try:
        a = int(input("Παρακαλώ εισάγετε έναν θετικό ακέραιο αριθμό: "))
        b = int(input("Παρακαλώ εισάγετε έναν ακόμα θετικό ακέραιο αριθμό: "))
        if ((a <= 0) or (b <= 0)):
            print("Παρακαλώ εισάγετε μόνο θετικούς ακεραίους και όχι αρνητικούς ή μηδέν!")
            print()
            continue
        break
    except ValueError:
        print("Παρακαλώ εισάγετε μόνο θετικούς ακεραίους ΑΡΙΘΜΟΥΣ και όχι χαρακτήρες!")
        print()

if (a * b) < 1000:
    print(f"To γινόμενο των {a} * {b} είναι {a*b}.")
else:
    print(f"To άθροισμα των {a} + {b} είναι {a+b}.")
